#+TITLE: Introduction to the course
#+AUTHOR: Marcus Birkenkrahe
#+SUBTITLE: Data structures with C++ (CSC 240)
:REVEAL_PROPERTIES:
#+REVEAL_ROOT: https://cdn.jsdelivr.net/npm/reveal.js
#+REVEAL_REVEAL_JS_VERSION: 4
#+REVEAL_INIT_OPTIONS: transition: 'cube'
#+REVEAL_THEME: black
:END:
#+STARTUP:overview hideblocks indent
#+OPTIONS: toc:1 num:1 ^:nil
#+PROPERTY: header-args:C++ :main yes :includes <iostream> :results output :exports both :noweb yes
#+PROPERTY: header-args:C :main yes :includes <stdio.h> :results output :exports both :noweb yes
** Emacs - the world's most customizable hacking power tool

- You've most likely worked with Emacs + Org-mode and the literate
  programming approach in my other data science or computing courses.

- Test your memory with a few review questions:

  1. What is special about Emacs?
     #+begin_quote
     *Emacs* is a self-extensible, free, open source editor written in a
     Lisp dialect, and first published in the 1980s by Richard
     Stallman. It is a hacker- and power-user tool because of its
     customizability and openess. The vanilla version can be
     downloaded from [[https://www.gnu.org/software/emacs][gnu.org/software/emacs]]. Famous applications:
     [[https://orgmode.org][Org-mode]] (for literate programming) and [[https://magit.vc/][magit]] (for
     Git). Additional resource: [[https://www.gnu.org/software/emacs/refcards/pdf/refcard.pdf][Emacs Reference Card]].
     #+end_quote

  2. What is Org-mode?
     #+begin_quote
     *Org-mode* is an Emacs mode (plugin or extension package) for
     plain-text note-taking, task management, documentation. It was
     first released in 2003 by Carsten Dominik. More information at
     [[https://orgmode.org/][orgmode.org]]. Famous application: [[http://literateprogramming.com/][literate programming]],
     [[https://orgmode.org/worg/org-tutorials/org-spreadsheet-intro.html][spreadsheets]]. Additional resource: [[https://www.gnu.org/software/emacs/refcards/pdf/orgcard.pdf][Org-mode Reference Card]].
     #+end_quote

  3. What is Literate Programming?
     #+begin_quote
     *Literate Programming* is a programming paradigm introduced by
     Donald Knuth in the 1970[fn:1]. It emphasises writing code and
     documentation together to make programs better structured and
     more enjoyable to read and understand by humans. More information
     at [[http://literateprogramming.com/][literateprogramming.com]].  Famous application: The [[https://www.ctan.org/starter][TeX]]
     typesetting system, which dominates technical and scientific
     publishing.
     #+end_quote
  4. How can you run the "Hello World" program in C++ inside Emacs?
     #+begin_src C++ :main yes :includes <iostream> :namespaces std :results output :exports both
       cout << "Hello, World!" << endl;
     #+end_src
     This code chunk is a souped-up (by way of header arguments)
     version of this complete program:
     #+begin_src C++ :results output :exports both
       // include input/output library
       #include <iostream>
       // use standard namespace for cout, endl
       using namespace std;
       int main() { // begin of main function
         // stream string to standard output then print newline
         cout << "Hello, world!" << endl;
         // return 0 when program ran successfully
         return 0;
       } // end of main function
     #+end_src
     The only header arguments left are: =C++= for the language,
     =:results output= to stream output to the screen, and =:exports both=
     to export both source code and output (e.g. to LaTeX, Markdown or
     HTML).

  5. How can you run "Hello World" in C inside Emacs?
     #+begin_src C
       puts("Hello, World!");
     #+end_src

     #+RESULTS:
     : Hello, World!

     This code chunk works only because of the =#+property:= header at
     the top of the file:
     #+begin_example
       #+property: header-args:C :main yes :includes <stdio.h> :results output
     #+end_example

     To make use of it, you only need to open the file or run it with
     =C-c C-c=. If you work with code that includes functions outside of
     =main=, you need to change the header arguments. Example:

     #+begin_src C :main no
       void hello(void); // prototype definition

       int main(void)
       {
         hello();
         return 0;
       }

       void hello(void)
       {
         puts("Hello, World!");
       }
     #+end_src

     #+RESULTS:
     : Hello, World!

     Nt

  6. What are the differences between the C and the C++ versions?
     #+begin_quote
     | C++                  | C             |
     |----------------------+---------------|
     | =<iostream>=           | =<stdio.h>=     |
     | =using namespace std=  | [fn:2]        |
     | =cout <<= ... =<< endl;= | =puts("...");=  |
     | header-args:C++      | header-args:C |

     What does the =<>= mean in the =#include= statements?[fn:3]
     #+end_quote

  7. Why are we using Emacs + Org-mode instead of the VSCode or
     Code::Blocks IDEs?
     #+begin_quote
     While VSCode and Code::Blocks are excellent IDEs with their own
     strengths, Emacs + Org-mode provides a unique combination of
     customizability, integrated task management, support for literate
     programming, and a powerful text editing environment that can
     lead to a more efficient and personalized workflow, and that
     teaches you important file management and productivity
     techniques - with a much higher transfer value than other tools.
     #+end_quote

- Having mastered and used Emacs daily will give you an edge in the
  job market (esp for programming jobs) and you should mention it as
  "Literate Programming with Emacs/Org-mode" on your resume.

